In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

### Creating pandas DataFrame

In [5]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [6]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [8]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

### Getting a few series together

In [9]:
df[['W', 'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [10]:
type(df['W'])

pandas.core.series.Series

In [11]:
type(df[['W', 'Z']])

pandas.core.frame.DataFrame

### Create a new column

In [12]:
df['WX'] = df['W'] * df['X']

In [13]:
df

          W         X         Y         Z        WX
A  0.302665  1.693723 -1.706086 -1.159119  0.512631
B -0.134841  0.390528  0.166905  0.184502 -0.052659
C  0.807706  0.072960  0.638787  0.329646  0.058930
D -0.497104 -0.754070 -0.943406  0.484752  0.374851
E -0.116773  1.901755  0.238127  1.996652 -0.222074

### Remove a column

In [14]:
# axis 1 means referring to column
df.drop('WX', axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [15]:
# This doesn't happens inplace.

df

          W         X         Y         Z        WX
A  0.302665  1.693723 -1.706086 -1.159119  0.512631
B -0.134841  0.390528  0.166905  0.184502 -0.052659
C  0.807706  0.072960  0.638787  0.329646  0.058930
D -0.497104 -0.754070 -0.943406  0.484752  0.374851
E -0.116773  1.901755  0.238127  1.996652 -0.222074

In [16]:
df.drop('WX', axis=1, inplace=True)

In [18]:
# Now removed inplace
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Removing the rows

In [19]:
df.drop('A', axis=0)

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Selecting rows

In [20]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [21]:
# Getting by indexes

df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

### Selecting combination of rows and columns

In [23]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905